<template lang="pug">
.editor
  h1 Редактор
  p Редактор представляет собой область с узлами и соединениями между их сокетами. Доступны следующие возможности:
  ul
    li Взаимодействие с рабочей областью (перемещение, масштабирование) и управление узлами (перемещение, добавление, удаление)
    li Отображение соединений, узлов, их входов/выходов и контролов
    li Обработка событий редактора
    li Импорт/экспорт схемы в JSON формате
    li Расширение функционала с помощью плагинов
    li Кастомизация рабочей области, узлов и соединений
  p Создайте экземпляр 
    i NodeEditor
  Code(source="editorInstance")
  p параметр demo@0.1.0 - это идентификатор вашего приложения/редактора.
  p контейнер представляет собой простой HTML-элемент

  h2 Идентификатор
  p Идентификатор состоит из имени приложения и версии. Версия необходима для контроля импорта данных в Ваш редактор, поскольку данные из предыдущих версий могут быть несовместимы с текущей версией Вашего редактора (не путать с версией фреймворка). То же правило существует для Движка, который позволяет предотвратить неожиданный результат из-за несовместимости данных с реализацией Воркеров в узлах

  h2 Импорт/экспорт данных
  p Чтобы сохранить добавленные узлы в редакторе и все соединения с ними, просто вызовите метод toJSON объекта NodeEditor
  Code(source="toJson")
  p Данные имеют следующую структуру:
  Code(source="dataStructure")
  p С таким же успехом вы можете восстановить содержимое редактора, используя эти данные (при условии, что версии ваших данных и Редактора совпадают)
  Code(source="fromJson")
  p В случае различных идентификаторов данных и редактора, метод fromJSON выбрасывает исключение. Вы должны поймать исключение и уведомить пользователя или попытаться адаптировать данные к новой версии вашего редактора

</template>

<script>
import Code from '@/shared/Code.vue';

export default {
  components: {
    Code
  }
}
</script>

<style lang="sass" scoped>
.editor
</style>
