<template lang="pug">
.components
  h1 Компоненты
  p Компоненты предназначены для упрощения разработки за счет сочетания тесно связанных функций построения и обработки узлов.
  p Компонент содержит билдер и воркер
  Code(source="componentPure")
  p
    | Билдер и воркер выполняются независимо друг от друга (первый работает один раз при создании узла, второй - при каждой обработке).
    | На самом деле они тесно связаны друг с другом в пределах одного узла.
  p Регистрация компонента:
  Code(source="registerComponent")

  h2 Билдеры узлов
  p Эти методы должны модифицировать экземпляр Node и необходимы редактору для восстановления всех узлов из данных JSON, поскольку данные JSON должны хранить только статическую информацию, а не логику узлов. 
  p Каждый из билдеров должен быть в соответствующем компоненте:
  Code(source="builder")

  h2 Воркеры узлов
  p 
    | Воркер - это функция для обработки данных узла. Они получают параметры узла, входы, выходы, и аргументы, передаваемые при обработке (опционально). 
    | Данные узла (не экземпляр узла), входы и выходы соответствуют определениям в билдерах (см. выше).
  Code(source="worker")
  p Как вы заметили, вы можете использовать асинхронные функции (или Promise для предыдущих версий ES). Это необходимо для выполнения сложных вычислений без блокировки основного потока (например, в WebWorker).


</template>


<script>
import Code from '@/shared/Code';

export default {
  components: {
    Code
  }
}
</script>


<style lang="sass" scoped>
.components
</style>
