export default () => [
    ["имя", {
        ua: "ім'я"
    }],
    ["модифицировать узел", {
        ua: "модифікувати вузол"
    }],
    ["обработать данные", {
        ua: "обробити дані"
    }],
    ["может иметь множество соединений", {
        ua: "може мати безліч з'єднань"
    }],
    ["третий параметр должен быть false, чтобы запретить множество подключений", {
        ua: "третій параметр повинен бути false, щоб заборонити безліч підключень"
    }],
    ["например, вызовите editor.process()", {
        ua: "наприклад, визвіть editor.process()"
    }],
    ["предотвратить добавление нового узла", {
        ua: "запобігти додаванню нового вузла"
    }],
    ["Vue.js компонент, не обязателен", {
        ua: "Vue.js компонент, не обов'язковий"
    }],
    ["свойства для компонента выше, не обязателен", {
        ua: "властивості для компоненту вище, не обов'язковий"
    }],
    ["принудительное обновление представления", {
        ua: "примусове оновлення представлення"
    }],
    ["в некоторых случаях вам может потребоваться Vue.js контекст", {
        ua: "у деяких випадках вам може потребуватися Vue.js контекст"
    }],
    ["ключ должен быть 'output'", {
        ua: "ключ повинен бути 'output'"
    }],
    ["ключ должен быть 'name'", {
        ua: "ключ повинен бути 'name'"
    }],
    ["здесь вы можете модифицировать возвращаемые в модуль выходные данные", {
        ua: "тут ви можете модифікувати повертаємі у модуль вхідні дані"
    }],
    ["ключ должен быть 'module'", {
        ua: "ключ повинен бути 'module'"
    }],
    ["ключ должен быть 'input'", {
        ua: "ключ повинен бути 'input'"
    }],
    ["enabled равен true по умолчанию", {
        ua: "enabled має значення true за замовчуванням"
    }],
    ["вызывается при инициализации всех тасков (при engine.process())", {
        ua: "викликається при ініціализації усіх тасків (при engine.process())"
    }],
    ["data это 'any data' из run()", {
        ua: "data це 'any data' з run()"
    }],
    ["предотвращает переход к выходному таску, который соединен с текущим через первый 'option' сокет", {
        ua: "запобігає переходу до вихідного таску, який з'єднаний з поточним через перший 'option' сокет"
    }],
    ["возвращает выходные данные", {
        ua: "повертає вихідні дані"
    }],
    ["параметр 'node' как у worker()", {
        ua: "параметр 'node' як у worker()"
    }],
    ["'inputs' содержит имена переменных", {
        ua: "'inputs' містить імена змінних"
    }],
    ["добавить строку кода", {
        ua: "додати рядок коду"
    }],
    ["добавить переменную со значением \"node.data.num\"", {
        ua: "додати змінну зі значенням \"node.data.num\""
    }],
    ["по умолчанию отступ для новых кадров равен 30px", {
        ua: "за замовчуванням відступ для нових кадрів дорівнює 30px"
    }],
    ["DEFAULT или LINEAR трансформер", {
        ua: "DEFAULT або LINEAR трансформер"
    }],
    ["опционально, кастомный трансформер", {
        ua: "опціонально, кастомний трансформер"
    }],
    ["идентификатор кривой", {
        ua: "ідентифікатор кривої"
    }],
    ["опционально", {
        ua: "опціонально"
    }],
    ["вход или выход", {
        ua: "вхід або вихід"
    }],
    ["предотвратить соединение", {
        ua: "запобігти з'єднання"
    }],
    ["предотвратить отсоединение", {
        ua: "запобігти від'єднання"
    }],
    ["внутри метода \"change\" вашего Control (вызывается по действию пользователя)", {
        ua: "всередені методу \"change\" вашого Control (викликається при дії користувача)"
    }],
    ["this.value - значение до изменения", {
        ua: "this.value - значення до зміни"
    }],
    ["next - новое значение", {
        ua: "next - нове значення"
    }],
    ["(v) => this.set(v) - коллбэк для изменения значения поля по undo/redo", {
        ua: "(v) => this.set(v) - колбек для зміни значення поля по undo/redo"
    }],
    ["где path это стек меню для каждого компонента", {
        ua: "де path це стек меню для кожного компонента"
    }],
    ["исключение компонента из меню", {
        ua: "виключення компонента із меню"
    }],
    ["", {
        ua: ""
    }],
    ["", {
        ua: ""
    }],
    ["", {
        ua: ""
    }],
]