<template lang="pug">
.nodes
  h1 Узлы
  Node
  p Все узлы могут содержать имя, входы, выходы и контролы.
  p Имя должно идентифицировать узел и однозначно указывать его предназначение.
  p 
    | Входы и выходы должны быть расположены слева и справа от узла соответственно (для кастомных узлов могут быть исключения).
    | Они представлены сокетом и могут иметь имена. Все выходы могут иметь неограниченное количество соединений. 
    | По умолчанию входы могут иметь только одно соединение. Вы можете изменить это как для входов, так и для выходов
  p Вход с неограниченным количествой подключений, выход с разрешенным только одним соединением:
  Code
    | new Rete.Input ('num', 'Number', numSocket, true);
    | new Rete.Output ('num', 'Number', numSocket, false);
  p 
    | Контролы могут располагаться либо непосредственно на самом узле, либо прикреплены к конкретному входу. 
    | Фактически, местоположение в первом случае определяется в стандартном шаблоне плагина для рендеринга. 
    | Во втором случае Контрол отображается, когда на входе нет соединения.
    | Это необходимо для гарантии того, что Контрол отвечает за предоставление входных данных, когда они не передаются с другого узла.
  p Давайте создадим узел (исключительно для создания в Билдере)
  Code(source="createNode")
  
</template>


<script>
import Code from '@/shared/Code.vue';
import Node from '../shared/Node.vue';

export default {
  components: {
    Code,
    Node
  }
}
</script>


<style lang="sass" scoped>
.nodes
</style>
